{
    "threat_horde_spawn_timed_nightfall": "A distant growl rolls across the darkening land! The sound of footsteps gets louder as a horde comprising of <c>{composition}</c> emerges from the treeline, moving closer with growing hunger. ",
    "threat_horde_spawn_timed_deep_night": "You catch glimpses of movement between the trees and vines. The shadows themselves seem to be moving. You notice a horde, which includes <c>{composition}</c> coming towards your location!",
    "threat_horde_spawn_timed_witching_hour": "Reality fractures with a cacophony of unholy wails that split the air like breaking glass! The very earth trembles as a massive horde comprising of <c>{composition}</c> emerges from the eternal darkness.",
    "threat_horde_spawn_timed_pre_dawn": "Just as hope of survival arrives, the cruel night delivers another blow. A small horde consisting of <c>{composition}</c> moves closer!",


    "threat_noise_spawn": [
        "Your commotion pierces the silence. From the murky darkness, a lone <c>{monsterName}</c> turns its attention toward the source of the disturbance.",
        "The racket you've made ripples through the night. A solitary <c>{monsterName}</c> emerges from its hiding place having its predatory instincts piqued by the sound.",
        "Your noise reverberates through the stillness, and something hears it. A <c>{monsterName}</c> appears from the shadows, stalking toward the origin of the sound."
    ],
    "threat_noise_despawn": [
        "The silence returns and <c>{monsterList}</c> {loseVerb} focus on the fading disturbance and {wanderVerb} back into the consuming darkness.",
        "As the noise fades to nothing, <c>{monsterList}</c> {loseVerb} interest in the hunt and slowly {wanderVerb} away, melting back into the shadows",
        "The commotion dies down, and <c>{monsterList}</c> {loseVerb} the scent and {wanderVerb} off into the night, seeking other prey.",
        "Your surroundings quiet once more causing <c>{monsterList}</c> to {loseVerb} all curiosity and {wanderVerb} aimlessly back into the depths of the darkness."
    ],
    

    "threat_horde_attacks_fortification_cabin": [
        "{monsterList} {hurlVerb} against the cabin with force, claws raking across wood and fists hammering at the windows. The structure takes <c>{totalDamage} damage!</c>",
        "{monsterList} {tearVerb} at the cabin's defenses with relentless hunger, dealing <c>{totalDamage} damage</c> to the fortifications!",
        "{monsterList} {slamVerb} into the doors and windows of the cabin with monstrous strength. The fortification takes <c>{totalDamage} damage!</c>",
        "{monsterList} {assaultVerb} the wooden cabin in a frenzy. The barriers crack and buckle, sustaining <c>{totalDamage} damage!</c>"
    ],
    "threat_horde_attacks_fortification_campGate": [
        "{monsterList} {crashVerb} into the campsite gate with brutal momentum. The fortification takes <c>{totalDamage} damage!</c>",
        "{monsterList} {slamVerb} at the campsite gate repeatedly, each impact sending shockwaves through the barrier. The gate sustains <c>{totalDamage} damage</c> from the onslaught!",
        "{monsterList} {tearVerb} at the barricade, causing the foundations to shake and dealing <c>{totalDamage} damage!</c>"
    ],
    "threat_horde_attacks_fortification_graveyardGate": [
        "{monsterList} {attackVerb} at the graveyard gate with relentless hunger, splintering the wood. The fortification sustains <c>{totalDamage} damage!</c>",
        "{monsterList} {hammerVerb} against the graveyard gate. The old structure suffers <c>{totalDamage} damage</c> from the attack!"
    ],

    "threat_fortification_breached_cabin": "With a final, splintering crack, the <c>cabin door explodes</c> inward in a shower of wood. The monsters surge through the ruined entrance!{noLongerHiding}",
    "threat_fortification_breached_campGate": "<c>The campsite gate collapses</c> with a loud crash and its supports give way completely. The barrier crumbles as the monsters pour through the breach, racing toward the campfire's light.{noLongerHiding}",
    "threat_fortification_breached_graveyardGate": "<c>The graveyard gate becomes unstable</c> and finally snaps. The structure topples sideways and the monsters flood through into hallowed ground!{noLongerHiding}",

    "threat_fortification_non_existing_cabin": "With no barrier to stop them, the monsters rush through the <c>undefended cabin doorway.</c> The open entrance offers no resistance to their invasion!{noLongerHiding}",
    "threat_fortification_non_existing_campGate": "The monsters surge past <c>the unfortified gate</c>, streaming through the opening like a dark tide. Nothing stands between them and the campfire's vulnerable glow.{noLongerHiding}",
    "threat_fortification_non_existing_graveyardGate": "The graveyard gate, <c>left undefended</c>, welcomes the monsters as they pour through the opening!{noLongerHiding}",


    "threat_horde_attacks_player": [
        "{monsterList} {swarmVerb} over you, striking from every angle. You take <c>{totalDamage} damage</c> from the brutal assault!",
        "{monsterList} {surgeVerb} forward and {overwhelmVerb} you with sheer force. The attack lands hard, dealing <c>{totalDamage} damage!</c>",
        "{monsterList} {closeVerb} the distance and {strikeVerb} without mercy. The impact leaves you reeling, taking <c>{totalDamage} damage!</c>"
    ],

    "threat_vampire_life_drain": [
        "The <c>Vampire</c> moves with inhuman speed, closing the gap. Its fangs pierce deep into your flesh as it feeds, draining your very essence! You take <c>{damage} damage</c> while the Vampire's wounds knit together, recovering <c>{heal} health.</c>",
        "The <c>Vampire</c> lunges forward, biting deep and draining your vitality to mend its own wounds! You take <c>{damage} damage</c>, while the Vampire recovers <c>{heal} health.</c>",
        "The <c>Vampire</c> strikes like a serpent, its cold hands gripping you as it bites down hard. Your blood is pulled from you in agonizing waves. You take <c>{damage} damage</c> while the Vampire regenerates <c>{heal} health</c> from your stolen vitality."
    ],
    "threat_vampire_enfeeble": [
        "The <c>Vampire</c>'s eyes flash crimson as it traces an arcane symbol in the air with clawed fingers. A wave of crushing fatigue slams into you, sapping the strength from your muscles and leaving your limbs trembling. Your next attack will be <c>severely weakened!</c>",
        "The <c>Vampire</c> hisses, weaving a dark gesture in the air. A wave of exhaustion washes over you, leaving your limbs heavy and weak. Your next attack will be <c>enfeebled!</c>",
        "The <c>Vampire</c>'s lips curl into a cruel smile as it weaves a gesture of decay. An invisible force washes over you, draining your vigor and leaving you gasping. Your muscles refuse to respond properly. Your next attack will <c>lack its usual power!</c>"
    ],

    "threat_witch_heal_horde": [
        "The <c>Witch</c> throws back her head and cackles with glee. Her gnarled hands weave intricate patterns. A sickly green light erupts from her fingertips, cascading over the horde like corrupted rain. Wounds close and broken bones snap back into place as the monsters are healed for <c>{heal} health!</c>",
        "The <c>Witch</c> raises her hands, preparing her spell. A pulse of emerald energy explodes outward, washing over the horde in waves of unnatural restoration. The creatures' injuries mend as they recover <c>{heal} health!</c>",
        "The <c>Witch</c>'s cackling fills the air as she channels dark magic through her twisted fingers. Wisps of energy snake through the horde. The monsters surge forward with renewed strength, healed for <c>{heal} health!</c>"
    ],
    "threat_witch_throw_potion": [
        "From her position, the <c>Witch</c> produces a glass vial filled with bubbling crimson liquid. With a shriek of malice, she hurls it in your direction. The potion explodes near you in a spray of caustic fluid that sears exposed skin, dealing <c>{damage} damage!</c>",
        "The <c>Witch</c> reaches into her robes and withdraws a smoking potion bottle. She launches it through the air with surprising accuracy. It shatters at your feet, releasing a splash of alchemical fire that burns like liquid agony. You take <c>{damage} damage!</c>"
    ],



    "outcome_stop_hiding": [
        "You are <c>no longer hiding.</c>",
        "Your hiding spot <c>no longer conceals you.</c>",
        "You emerge from the shadows, <c>no longer hidden from view.</c>"
    ],

    "outcome_fortify_campGate": [
        "You hammer planks across the gate's weak points, reinforcing the structure with whatever wood you have. Sweat drips down your face as you secure the final board. The fortification strength is now at <c>{strength}.</c>",
        "Working quickly, you brace the gate with additional supports. The structure feels more solid under your hands. The fortification strength is now at <c>{strength}.</c>",
        "You wedge logs against the gate posts and bind them tight with whatever you can find. It's exhausting work, but the barrier is holding better now. The fortification strength is now at <c>{strength}.</c>"
    ],
    "outcome_fortify_cabin": [
        "Piece by piece, you barricade the cabin's vulnerable points. Your hands are raw, but the structure is more secure. The fortification strength is now at <c>{strength}.</c>",
        "You work methodically, covering each window with crossed boards and bracing the door with everything you can move. The cabin feels like a proper fortress now. The fortification strength is now at <c>{strength}.</c>"
    ],
    "outcome_fortify_graveyardGate": [
        "You lash wooden beams to the gate's frame and reinforce the hinges. The ancient structure holds firm under your additions. The fortification strength is now at <c>{strength}.</c>",
        "Working against the gate's deteriorating condition, you shore up its weak points with fresh timber. It won't win any beauty contests, but it's stronger. The fortification strength is now at <c>{strength}.</c>",
        "You wedge support beams against the gate. The gate becomes a bit more sturdy. The fortification strength is now at <c>{strength}.</c>"
    ],

    "outcome_rest_by_fire": [
        "You rest beside the campfire, letting its warmth seep into your aching muscles. The crackling flames provide a moment of comfort in the darkness.{staminaGain}",
        "You rest near the fire's glow, watching the embers dance as you catch your breath. The heat helps ease the tension from your body.{staminaGain}",
        "You settle by the campfire. Its light pushes back the shadows. For a brief moment, you allow yourself to relax.{staminaGain}"
    ],
    "outcome_rest_in_cabin": [
        "You sit on the worn sofa inside the cabin, grateful for the solid walls around you. The relative safety lets your guard down just enough to recover.{staminaGain}",
        "You lean against the cabin's interior wall and slide down to sit. The enclosed space feels safer, allowing you to rest more easily.{staminaGain}",
        "You find a corner in the cabin and settle in, the sturdy structure providing both shelter and peace of mind as you recuperate.{staminaGain}"
    ],
    "outcome_hide_in_tents": [
        "You slip quietly into one of the tents, pulling the flap closed behind you. You move carefully now, mindful that any sound could give you away.",
        "You crawl into a tent and crouch low, controlling your breathing. Hidden among the camping gear, you reduce the noise you make."
    ],
    "outcome_hide_in_cabin": [
        "You duck inside the cabin and press yourself against the wall, away from the windows. Concealed by walls and shadow, you're invisible to whatever lurks outside.",
        "You retreat into the cabin's interior and find a spot in the darkness. Hidden from view, your movements no longer draw attention."
    ],
    "outcome_hide_in_hut": [
        "You slip through the door of the gravekeeper's hut and tuck yourself into the corner. You force yourself to stay absolutely still and silent.",
        "You hurry into the gravekeeper's hut and crouch behind the sparse furniture. Every movement is deliberate and quiet. You can't risk being discovered."
    ],
    "outcome_wait_normal": [
        "You stand still for a moment, letting your racing heart slow. The brief pause helps clear your mind.{staminaRegen}",
        "You take a few deep breaths and gather your thoughts.{staminaRegen}"
    ],
    "outcome_wait_hiding": [
        "You hold your position, barely breathing. Through the gaps in your hiding spot, you keep watch on the darkness outside.",
        "You remain perfectly still, listening intently to every sound. Patience might be what keeps you alive."
    ],
    "outcome_heal_bandages": [
        "You unwrap a bandage with trembling hands and press it firmly against your wounds. The bleeding slows as you tie it off.{healthGain}",
        "You carefully apply the bandage to your injuries, wincing as you pull it tight. It's not perfect, but it'll keep you going.{healthGain}"
    ],
    "outcome_heal_first_aid": [
        "You flip open the first-aid-kit and quickly work through its contents: antiseptic stings as you clean the wounds, then gauze and bandages to wrap them. The supplies are a godsend.{healthGain}",
        "You pour antiseptic from the first-aid-kit over your injuries. You follow up with clean bandages and gauze, doing your best to patch yourself up properly.{healthGain}"
    ],
    "outcome_eat_canned_food": [
        "You pry open one of the cans and eat its contents cold. It's not appetizing, but your body desperately needs the sustenance.{staminaGain}{healthGain}",
        "You force down the canned food quickly, not bothering to taste it. The nutrition works its way through your system, restoring some energy.{staminaGain}{healthGain}"
    ],
    "outcome_eat_cooked_mushrooms": [
        "You bite into the cooked mushrooms, savoring the earthy flavor. The warm food settles in your stomach, renewing your strength.{staminaGain}{healthGain}",
        "You eat the mushrooms you prepared earlier. They're simple, but the cooked food provides real nourishment that your body craves.{staminaGain}{healthGain}"
    ],

    "outcome_craft_molotov": [
        "You carefully pour the fuel into the empty bottle, filling it about three-quarters full. The fumes make your eyes water as you stuff the old rag into the neck, leaving enough hanging out to serve as a wick. The weight of it in your hand feels dangerous: one spark and this becomes a weapon of devastating fire.",
        "With steady hands, you funnel fuel into the glass bottle, then tear a strip from the rag and wedge it tight into the opening. The makeshift incendiary device sloshes ominously. One throw, one flame, and the horde will burn."
    ],
    "outcome_craft_witch_ward": [
        "You work methodically, binding the rowan berries to a frame of crossed wooden sticks with twine. The traditional pattern takes shape under your fingers. The ward is an ancient protection against dark magic. As you tie off the final knot, the ward seems to pulse with quiet power. Witches cannot abide the touch of rowan.",
        "Your fingers weave twine around wood and rowan berries, creating the intricate pattern of a Witch Ward. The crimson berries stand out against the pale wood like drops of blood. This old charm carries weight... Witches have feared rowan since time immemorial, and this ward will make them suffer for drawing near."
    ],
    "outcome_craft_black_salt": [
        "You crush the garlic cloves and mix them thoroughly with the salt. A pungent aroma fills your nostrils. The combination turns darker as you work it together to prepare the Black Salt: a traditional deterrent against Vampires. The undead recoil from garlic's essence, and salt burns their unnatural flesh. This mixture will make an effective weapon.",
        "You grind the garlic into the salt with focused intensity, watching as the white crystals take on a grey-black hue. The sharp, acrid smell is almost overwhelming. Black Salt: Vampire's bane. The creatures of the night cannot stand against this ancient defense."
    ],
    "outcome_cook_mushrooms": [
        "You skewer two mushrooms on a stick and hold them over the campfire's flames. They sizzle and brown as the heat works through them, releasing an earthy aroma. After a few minutes, you pull them back, ready to eat.",
        "You place the mushrooms near the fire's edge and let them roast slowly, turning them occasionally. The heat transforms them into something more palatable and nourishing. You collect the Cooked Mushrooms once they're done."
    ],
    "outcome_set_trap_campGate": [
        "You construct a sturdy trap near the campsite gate, using wood to create a weighted mechanism. It's crude but effective, designed to crush or impale anything that triggers it. One monster, at least, won't make it past this point.",
        "You work quickly to assemble a deadly trap at the gate's entrance. You setup a trigger mechanism that will release with the slightest pressure. The first creature through won't know what hit it.",
        "You rig a brutal trap using the available wood. A trap that will almost certainly kill the first thing that passes through. One pull, and something dies."
    ],
    "outcome_set_trap_graveyardGate": [
        "You string up the net above the graveyard gate, securing it to wooden supports on either side. When the net falls, it will trap and kill anything caught into it.",
        "You weave the net between wooden posts above the gate entrance, creating a snare that will collapse on command. The trap is supposed to . This trap will claim at least one victim."
    ],

    "outcome_search_rec_tent": "You push aside the tent flap and search through the recreational area, digging through duffel bags and storage bins. Your efforts pay off as you uncover <c>a baseball bat</c>, <c>a hunting bow</c> in surprisingly good condition, and a quiver containing <c>5 arrows.</c>",
    "outcome_search_woods": "You venture into the woods beyond the campsite's perimeter, moving carefully through the undergrowth. You harvest <c>4 mushsooms</c> growing near rotting logs, discover <c>2 garlic</c> bulbs in a wild patch, and gather <c>2 pieces of usable wood</c> from fallen branches.",
    "outcome_search_woods_again": [
        "You return to the woods and search more thoroughly this time, scanning the ground and low-hanging branches. Your persistence is rewarded as you manage to collect <c>{quantity} wood.</c>",
        "You venture back into the woods, combing through the underbrush for anything useful. After some searching, you find <c>{quantity} wood</c> worth taking.",
        "You make another trip into the woods, checking areas you might have missed before. Your efforts yield <c>{quantity} wood.</c>"
    ],
    "outcome_search_food_tent": "You rifle through the food storage tent, checking coolers and supply crates. Among the provisions, you find <c>an empty glass bottle</c>, <c>2 salt shakers</c> that are still half-full, and <c>2 cans of preserved food.</c>",
    "outcome_search_utility_tent": "You investigate the utility tent, sorting through equipment and supply boxes. Your search yields <c>an old cleaning rag</c> and <c>2 individually wrapped bandages.</c> They are basic supplies, but valuable nonetheless.",
    "outcome_search_pier": "You make your way to the water's edge and search around the wooden pier, checking the posts and storage boxes nearby. You recover <c>2 fishing nets</c> and <c>2 coils of sturdy twine.</c>",
    "outcome_search_cabin_items": "You thoroughly search the cabin's interior, opening drawers and checking cabinets. You discover <c>a can of fuel</c> stored under the sink and a well-stocked <c>first-aid-kit</c> mounted on the wall.",
    "outcome_gather_rowan_tree": "You approach the rowan tree in the graveyard, its branches heavy with clusters of bright berries. You climb carefully, testing each foothold, and manage to pluck <c>2 handfuls of rowan berries</c> before descending.",
    "outcome_search_gravekeepers_hut": "You enter the gravekeeper's hut and look through its sparse contents. On a shelf, you find <c>2 bandages</c> in decent condition, and hanging by the door is <c>an old iron key.</c>",
    "outcome_search_shed": "You pry open the shed's warped door and peer inside through the dusty gloom. Leaning against the back wall is <c>a wood-cutting axe</c>, its blade still sharp and ready for use.",

    "outcome_attack_single_zombie": [
        "You swing your {weapon} at a Zombie with determination.{cursed} The strike connects solidly, dealing <c>{damage} HP</c> of damage.{kill}",
        "You bring your {weapon} down on the Zombie, putting your weight behind the blow.{cursed} You deal <c>{damage} HP</c> of damage to it.{kill}"
    ],
    "outcome_attack_single_skeleton": [
        "You strike at the Skeleton with your {weapon}, aiming for its exposed bones.{cursed} The impact deals <c>{damage} HP</c> of damage.{kill}",
        "You swing your {weapon} at the Skeleton's rattling frame.{cursed} You deal <c>{damage} HP</c> of damage to it.{kill}"
    ],
    "outcome_attack_single_spirit": [
        "You swing your {weapon} at the Spirit.{cursed} The weapon passes through, somehow dealing <c>{damage} HP</c> of damage.{kill}",
        "You strike at the Spirit with your {weapon}, the blade cutting through its ghostly essence.{cursed} You deal <c>{damage} HP</c> of damage.{kill}"
    ],
    "outcome_attack_cleave": [
        "You wind up and swing your weapon in a wide arc through the horde.{cursed} The cleaving strike connects with multiple targets, dealing a combined <c>{damage} HP</c> of damage and hitting <c>{numHit} monsters</c>.{kill}",
        "You execute a sweeping attack, your blade cutting through the horde's front line.{cursed} The cleave hits <c>{numHit} monsters</c> for a total of <c>{damage} HP</c> of damage.{kill}",
        "You put all your strength into a horizontal slash that tears through the horde.{cursed} Your cleaving blow strikes <c>{numHit} monsters</c>, dealing <c>{damage} HP</c> of damage total.{kill}"
    ],
    "outcome_attack_incinerate": [
        "You light the rag and hurl your Molotov into the center of the horde.{cursed} The bottle shatters on impact, erupting into a massive fireball that engulfs <c>{numHit} monsters.</c> Flames spread rapidly through their ranks, dealing a devastating <c>{damage} damage</c> total.{kill}",
        "You ignite the Molotov and throw it with precision at the horde's densest point.{cursed} Glass explodes and fuel ignites in a roaring inferno, catching <c>{numHit} monsters</c> in the blaze. The fire spreads hungrily, dealing <c>{damage} damage</c> as the creatures shriek and burn.{kill}",
        "You set the rag ablaze and launch the bottle toward the horde.{cursed} The Molotov detonates in a brilliant explosion of flame, immediately engulfing <c>{numHit} monsters.</c> Fire cascades through their ranks like a living thing, inflicting <c>{damage} damage</c> total.{kill}"
    ],
    "outcome_attack_shoot": [
        "You nock an arrow, draw back the bowstring, and release.{cursed} The arrow flies true, striking a <c>{monster}</c> squarely. You deal <c>{damage} HP</c> of damage.{kill}",
        "You take aim with your bow and loose an arrow at a <c>{monster}.</c>{cursed} The shot connects, dealing <c>{damage} HP</c> of damage.{kill}",
        "You pull back your bow and let the arrow fly toward a <c>{monster}.</c>{cursed} It hits its mark, dealing <c>{damage} HP</c> of damage.{kill}"
    ],
    "outcome_attack_boss_witch": [
        "You charge at the Witch and swing your {weapon} with all your might.{cursed} She attempts to dodge but you manage to strike her, lowering her health by <c>{damage} HP.</c>{kill}",
        "You close the distance and attack the Witch with your {weapon}.{cursed} Your weapon finds its mark, dealing <c>{damage} HP</c> of damage.{kill}"
    ],
    "outcome_attack_boss_vampire": [
        "You lunge at the Vampire and strike with your {weapon}.{cursed} The blow lands, dealing <c>{damage} HP</c> of damage to the creature.{kill}",
        "You attack the Vampire with your {weapon}, moving quickly before it can counter.{cursed} You successfully deal <c>{damage} HP</c> of damage.{kill}"
    ],
    "outcome_hurt_boss_witch": [
        "You produce the Witch Ward you crafted and hurl it directly at the Witch. The rowan-woven charm strikes her and she recoils with a piercing shriek... the sacred wood burns her dark essence. The Ward deals <c>{damage} HP</c> of damage, far more effective than any mundane weapon.{kill}",
        "You throw the Witch Ward at her with precision. The moment it makes contact, the Witch screams in agony as the rowan berries sear through her magical defenses. The Ward inflicts <c>{damage} HP</c> of damage, exploiting her ancient weakness.{kill}"
    ],
    "outcome_hurt_boss_vampire": [
        "You grab your Black Salt and fling it at the Vampire in a wide arc. The blessed mixture scatters across its undead flesh, causing it to hiss and smoke where it lands. The garlic-infused salt burns through its supernatural resilience, inflicting <c>{damage} HP</c> of damage.{kill}",
        "You hurl the Black Salt directly at the Vampire. The creature shrieks as the salt makes contact, its flesh sizzling and recoiling from the garlic-laced grains. The traditional Vampire's bane deals <c>{damage} HP</c> of damage, far more than any ordinary weapon could manage.{kill}"
    ],
    "outcome_trap_triggered": [
        "You hear {count} loud *SNAP!* from outside. The trap mechanism worked perfectly, catching and killing <c>{monsterList}</c> before they could reach you!",
        "The sound of {count} loud *SNAP!* fills the air. Your preparation paid off, stopping <c>{monsterList}</c> which triggered the mechanism!"
    ],



    "status_health_low": "Your health is low. You should find a way to heal.",
    "status_health_critical": "CRITICAL: Your health is dangerously low! Heal immediately!",
    "status_stamina_low": "You are feeling exhausted and sluggish. Find a way to regain your stamina.",
    "status_stamina_critical": "CRITICAL: You are about to collapse from exhaustion! You must rest!",



    "action_text_move_to_graveyard": "Move to Graveyard",
    "action_text_move_to_cabin": "Move to Cabin",
    "action_text_move_to_campsite": "Move to Campsite",

    "action_text_fortify_campGate": "Fortify Campsite gate",
    "action_text_fortify_cabin": "Fortify Cabin doors & windows",
    "action_text_fortify_graveyardGate": "Fortify Graveyard gate",

    "action_text_rest_by_fire": "Rest by the campfire",
    "action_text_rest_in_cabin": "Rest in the cabin",
    "action_text_hide_in_tents": "Hide in a tent",
    "action_text_hide_in_cabin": "Hide in the cabin",
    "action_text_hide_in_hut": "Hide in the gravekeeper's hut",
    "action_text_wait": "Wait and do nothing",
    "action_text_heal_bandages": "Heal using bandages",
    "action_text_heal_first_aid": "Heal using first-aid-kit",
    "action_text_eat_canned_food": "Eat canned food",
    "action_text_eat_cooked_mushrooms": "Eat cooked mushrooms",
    "action_text_craft_molotov": "Craft a Molotov",
    "action_text_craft_witch_ward": "Craft a Witch Ward",
    "action_text_craft_black_salt": "Craft some Black Salt",
    "action_text_cook_mushrooms": "Cook mushrooms by the campfire",
    "action_text_set_trap_campGate": "Set a trap at the Campsite gate",
    "action_text_set_trap_graveyardGate": "Set a trap at the Graveyard gate",

    "action_text_search_rec_tent": "Search the recreational tent",
    "action_text_search_woods": "Search in the woods",
    "action_text_search_woods_again": "Search through the woods again",
    "action_text_search_food_tent": "Search the food tent",
    "action_text_search_utility_tent": "Search the utility tent",
    "action_text_search_pier": "Search at the pier",
    "action_text_search_cabin_items": "Search for items in the cabin",
    "action_text_gather_rowan_tree": "Gather berries from the rowan tree",
    "action_text_search_gravekeepers_hut": "Search the gravekeeper's hut",
    "action_text_search_shed": "Search the shed",
    
    "action_text_attack_zombie": "Attack a Zombie",
    "action_text_attack_skeleton": "Attack a Skeleton",
    "action_text_attack_spirit": "Attack a Spirit",
    "action_text_attack_cleave": "Perform a cleave attack on the Horde", 
    "action_text_attack_incinerate": "Throw a Molotov to incinerate the Horde", 
    "action_text_attack_shoot": "Shoot at a monster using bow-and-arrow",
    "action_text_attack_boss_witch": "Attack the Witch",
    "action_text_attack_boss_vampire": "Attack the Vampire",
    "action_text_hurt_boss_witch": "Hurt the Witch",
    "action_text_hurt_boss_vampire": "Hurt the Vampire",



    "loc_desc_campsite_first": "A group of monsters is hot on your tail. The night is dangerous. You've managed to outrun the horde and get some time to get yourself under control. You find yourself in a campsite amidst a rough clearing through the woods as the sun begins to set. Several tents are pitched around a warm campfire. A wooden cabin stands at the far west. A small wooden pier extends over the dark water ahead.",
    "loc_desc_campsite_current": [
        "You remain at the campsite. The campfire burns bright, its flames crackling and popping as they provide warmth against the night's chill.",
        "The campsite remains your position. Overhead, the trees sway gently, their branches creating shifting patterns of light and shadow across the tents and clearing.",
        "You stay put at the campsite, keeping close to the fire's warmth. The flames dance and hiss occasionally, sending sparks spiraling upward into the dark sky.",
        "You remain here in the clearing, the familiar layout of tents and equipment surrounding you. The fire's glow pushes back the darkness, creating a small circle of relative safety.",
        "You stay at the campsite, the generator's steady hum blending with the crackling of burning wood. The pier extends into darkness ahead, and the cabin's lights glow to the west."
    ],
    "loc_desc_campsite_return": [
        "You return to the campsite, relieved to see the fire still burning strong. The familiar clearing opens before you, the generator's hum a constant backdrop.",
        "You make your way back to the center of the campsite. The glow of the campfire and cabin lights guides you in, a beacon of relative safety in the surrounding darkness.",
        "You return to the clearing, the familiar arrangement of tents and fire greeting you. The warmth of the flames reaches out as you step back into the circle of light.",
        "You head back to the campsite, the crackling fire and scattered tents coming into view. Everything remains as you left it, the space still holding back the night.",
        "You return to the campsite's heart, where the fire burns steadily. The pier stretches out into shadow to your right, and the cabin stands solid to the west."
    ],

    "loc_desc_cabin_first": "You step into the wooden cabin and close the door behind you, muffling the sounds of the night outside. The interior is cozy and well-maintained. A worn sofa faces a cold fireplace, and someone's jacket hangs on a peg by the door. Maps and a schedule are pinned to a corkboard near the window. The cabin smells of pine wood, lamp oil, and the faint mustiness of a place that's lived-in but currently empty. Through the windows, you can see the campfire outside, but in here, the generator's hum is more muted. It feels safer somehow, with walls between you and whatever's out there.",
    "loc_desc_cabin_current": [
        "You remain inside the cabin, the solid walls around you providing a sense of security. The lamplight flickers gently, casting familiar shadows across the worn furniture.",
        "You stay inside the cabin, listening to the muffled sounds of the night beyond the walls. The wooden floor creaks slightly as you shift your weight, the only sound in the quiet interior.",
        "You're still inside, grateful for the barrier between you and the darkness. Through the windows, you can see the campfire's glow outside, but in here it feels safer.",
        "You remain in the cabin's shelter, the musty smell of pine and old fabric a comforting constant. The generator's hum is barely audible through the walls.",
        "You stay put inside the wooden structure. The maps on the corkboard flutter slightly in a draft, and the cold fireplace sits dark and empty, but the space still feels like a refuge."
    ],
    "loc_desc_cabin_return": [
        "You return to the cabin and step back inside, pulling the door shut behind you. The lamplight welcomes you back, and the enclosed space immediately feels safer than being outside.",
        "You make your way back to the cabin and enter, closing the door firmly behind you. Everything is exactly as you left it... the sofa, the maps, the jacket on its peg.",
        "You return to the cabin's shelter, relieved to have walls around you again. Through the windows, you can see the campfire still burning outside, but the interior provides better protection.",
        "You step back into the cabin, the familiar creak of the floorboards greeting your return. The lamplight casts the same warm glow across the room, unchanged since you left.",
        "You head back to the cabin and slip inside. The generator's muted hum resumes its background presence, and the pine-scented air wraps around you like a blanket."
    ],

    "loc_desc_graveyard_first": "You arrive at the graveyard, and a chill runs down your spine that has nothing to do with the temperature. You remember glimpsing this place earlier when you were fleeing towards the campsite. Now here you are, standing among the dead. The graveyard sprawls across uneven ground, dotted with tombstones of varying ages. A gravekeeper's hut stands near the entrance, and a small locked shed sits further back.",
    "loc_desc_graveyard_current": [
        "You remain in the graveyard, acutely aware of how exposed you are among the tombstones. The wind whispers through the monuments, carrying an unnatural chill.",
        "You're still among the graves, surrounded by weathered stone and crumbling markers. The wind picks up slightly, making the loose shutter on the gravekeeper's hut bang rhythmically.",
        "You stay in the graveyard, though every instinct screams at you to leave this place of the dead. The shadows between tombstones seem deeper here, darker.",
        "You remain among the uneven rows of graves, counting the tombstones you can see... anything to keep your mind occupied and away from darker thoughts.",
        "You stay put in the cemetery. The gravekeeper's hut and distant shed are your only company besides the silent dead. The rowan tree's branches sway overhead, a dark silhouette against the sky."
    ],
    "loc_desc_graveyard_return": [
        "You make your way back to the graveyard along the gravel path. The iron gates come into view, and beyond them, the familiar arrangement of graves and weathered monuments.",
        "You return to the graveyard, emerging from the path into the open area among the graves. The air feels colder here, heavy with an oppressive stillness.",
        "You approach the cemetery once again, the iron gate creaking as you pass through. The tombstones stand like silent sentinels, and you hope you can handle whatever comes.",
        "You head back to the graveyard, the path leading you past the iron gates and into the sprawl of graves. The gravekeeper's hut sits near the entrance, and the rowan tree looms in the distance.",
        "You return to the cemetery grounds, the uneven terrain and weathered headstones spreading out before you. The shed sits in the back, and the whole place feels wrong in the darkness."
    ],

    

    "dusk_flavor_10": "The sun bleeds orange across the horizon, its dying light casting long shadows that stretch like grasping fingers across the ground. The air still holds the day's warmth, but there's a whisper of something colder creeping in.",
    "dusk_flavor_9": "Golden light filters through the trees, turning everything amber. The first evening birds begin their calls, oblivious to what the darkness might bring.",
    "dusk_flavor_8": "The sun sinks lower, painting the clouds in shades of crimson and purple.",
    "dusk_flavor_7": "The sky burns with the last defiant rays of daylight. A gentle breeze picks up, carrying the scent of cooling earth and distant pine.",
    "dusk_flavor_6": "Twilight settles over the landscape like a veil. The boundary between light and shadow blurs as the sun touches the horizon, preparing for its final descent.",
    "dusk_flavor_5": "The sun is half-swallowed by the earth now. Its light has turned from gold to deep orange. The ambient temperature begins to drop.",
    "dusk_flavor_4": "Only a sliver of sun remains visible, painting the sky in darkening purples. The first stars appear overhead, faint and tentative against the fading blue.",
    "dusk_flavor_3": "The last curve of the sun disappears, leaving only its afterglow.",
    "dusk_flavor_2": "The sky transitions from purple to deep indigo. Shadows have merged into larger patches of darkness, and the stars grow brighter with each passing second.",
    "dusk_flavor_1": "Dusk's final moments fade as the sky deepens to navy. The first hint of true darkness creeps across the land, and the air grows noticeably cooler against your skin.",

    "evening_flavor_8": "Evening arrives with a blanket of darker blue-grey across the heavens. The stars are now clearly visible, scattered like diamonds across velvet, and the moon begins its ascent. The comfortable warmth of day is gone, replaced by a chill that makes you pull your clothing tighter.",
    "evening_flavor_7": "The sky deepens to a rich cobalt, with the brightest stars forming their familiar constellations.",
    "evening_flavor_6": "Darkness settles more heavily. Night sounds begin: crickets chirping and the distant hoot of an owl setting out to hunt.",
    "evening_flavor_5": "The moon climbs higher, casting everything in shades of silver and shadow. Trees become dark silhouettes against the star-filled sky, their branches like skeletal hands reaching upward.",
    "evening_flavor_4": "Evening's grip tightens as the last traces of twilight vanish from the western horizon. The night is fully awake now, and every sound seems amplified in the quiet darkness.",
    "evening_flavor_3": "The moon's light creates a patchwork of illumination and shadow across the ground. A cold breeze rustles through the vegetation, carrying sounds that are harder to identify in the dark.",
    "evening_flavor_2": "Moonlight now gleams off surfaces: water, stone, anything smooth enough to reflect it back.",
    "evening_flavor_1": "Evening reaches its deepest point before transitioning to true night. The stars wheel slowly overhead, and the shadows seem to shift and move at the edges of your vision.",

    "nightfall_flavor_8": "True nightfall descends like a curtain, and the darkness takes on weight and substance. The moon hangs bright but somehow distant, its light feeling colder now, less comforting than before. The night sounds have changed: some creatures have gone silent, while others you can't identify have started calling.",
    "nightfall_flavor_7": "The cold intensifies as the temperature plummets. Shadows pool thick and heavy beneath trees and overhangs, places where moonlight cannot reach.",
    "nightfall_flavor_6": "A deep chill has settled over everything. Your breath comes out in visible clouds now.",
    "nightfall_flavor_5": "The night deepens further still. The moon's journey across the sky continues, and its angle creates unfamiliar shadows that make familiar landscapes seem strange and foreign.",
    "nightfall_flavor_4": "The remaining warmth left over from the day is completely gone, replaced by the deep cold of true night.",
    "nightfall_flavor_3": "Silence falls more heavily now, broken only by the occasional crack of a twig or the distant cry of a night bird. The darkness between shadows seems somehow darker.",
    "nightfall_flavor_2": "The moon reaches its highest point, bathing everything in pale, colorless light. But there are more shadows now.",
    "nightfall_flavor_1": "The world feels suspended, caught between the evening that was and the deeper darkness yet to come.",

    "deep_night_flavor_9": "Deep night arrives with an almost physical presence, as if the darkness itself has grown thicker, more tangible. The moon continues its arc but seems to give less light than before, its beams struggling to penetrate the gloom. Strange sounds echo from the darkness. This is the hour when natural creatures hide, and other forces emerge.",
    "deep_night_flavor_8": "Shadows seem to pulse and breathe at the periphery of vision, never quite still when you're not looking directly at them.",
    "deep_night_flavor_7": "An unnatural mist begins to rise from the ground, curling around rocks and tree roots like grasping fingers.",
    "deep_night_flavor_6": "The moonlight takes on an eerie quality, turning everything it touches into shades of grey and white.",
    "deep_night_flavor_5": "Deep Night continues as the time passes. Sounds that shouldn't exist drift through the air: whispers without words, footsteps without feet.",
    "deep_night_flavor_4": "The night sky deepens into absolute black, like a void, dotted with stars.",
    "deep_night_flavor_3": "The cold mist continues to form. Something feels fundamentally wrong about this hour.",
    "deep_night_flavor_2": "The moon's light wavers, as if something massive is passing between it and the earth.",
    "deep_night_flavor_1": "The boundary between what's real and what isn't seems thinner here, at this depth of night. Shapes in the mist could be trees, or they could be something else entirely.",

    "witching_hour_flavor_10": "The Witching Hour crashes down like a wave of pure darkness. The moon dims as if shrouded by invisible clouds, and the stars themselves seem to flicker uncertainly. The temperature plummets. This is the time when the veil is thinnest, when the dead walk and the things that should not be find their way into the world.",
    "witching_hour_flavor_9": "The darkness writhes and pulses with unseen presence. Shapes seem move through the mist with purpose now.",
    "witching_hour_flavor_8": "The night sky intensifies. The shadows have gained depth, becoming doorways to somewhere else.",
    "witching_hour_flavor_7": "The moon bleeds a sickly color, somewhere between silver and red.",
    "witching_hour_flavor_6": "Time feels distorted, stretching and compressing. Seconds last hours, minutes pass in heartbeats.",
    "witching_hour_flavor_5": "The Witching Hour reaches its apex. The boundary between worlds is paper-thin now, and things press against it from the other side.",
    "witching_hour_flavor_4": "Dead leaves swirl in spirals without wind to move them. Every sound seems swallowed by the oppressive stillness. The ground itself seems to hold its breath.",
    "witching_hour_flavor_3": "The Witching Hour continues. The stars trace paths slowly, offering no hope of dawn to come.",
    "witching_hour_flavor_2": "The stars begin their slow wheel toward morning positions, though dawn is still impossibly far away.",
    "witching_hour_flavor_1": "The witching hour's grip begins to weaken... barely. The absolute stillness starts to break as the faintest breath of wind stirs. The moon's color begins its slow fade back toward normal silver.",

    "pre_dawn_flavor_5": "The first hint of change arrives. The absolute black of the sky begins to lighten to merely dark grey in the far east. The unnaturality that filled the witching hour seems to have stopped. The temperature remains brutally cold, but no longer drops. The moon, pale and exhausted, begins its descent toward the western horizon. You've survived the worst. You just have to hold on a little longer.",
    "pre_dawn_flavor_4": "The eastern horizon shows a line of slightly lighter grey, barely distinguishable from the darkness above it.",
    "pre_dawn_flavor_3": "The stars begin to fade, the brightest ones clinging to visibility as the sky slowly lightens.",
    "pre_dawn_flavor_2": "The shadows lose their depth and menace, becoming ordinary darkness once more. Birds begin their first tentative chirps.",
    "pre_dawn_flavor_1": "The Pre-Dawn light strengthens, turning the world into a landscape of grey, silver, and yellow. The moon sets, its night's work done, and the cold finally begins to lose its cruel edge.",

    "phase_intro_dawn": "Dawn breaks like a golden sword cutting through the last remnants of darkness. The sun crests the horizon in a blaze of orange and pink and gold. The light is warm and real. The frost begins to melt immediately. Birds erupt into full chorus, celebrating the return of day with joyous abandon.",


    "game_over_lose": [
        "Your vision blurs as the wounds become too much. The last thing you feel is the cold, damp ground as darkness finally, completely, takes you.",
        "Your legs give out and you collapse, unable to rise again. Pain fades to numbness as the world dims around you. The night has claimed another victim.",
        "Your strength abandons you entirely, and you fall. Through fading consciousness, you see shapes closing in. Then nothing... only the embrace of eternal darkness."
    ],

    "game_over_win_monsters": "As the first warm rays of sunlight break over the horizon, the creatures shriek. In moments, they scatter and flee desperately back into the shadows, seeking refuge from the burning dawn.",
    "game_over_win_critical": [
        "You collapse against the nearest surface as the adrenaline finally drains away. Your body is a map of fresh wounds you didn't even feel during the fight. You're barely conscious, teetering on the edge... but you're alive. Dawn's light washes over you as you close your eyes, listening to the birds, waiting for rescue to arrive.",
        "Your legs buckle and you slide down to sit heavily on the ground. Blood seeps from a dozen injuries, and exhaustion crashes over you like a wave. You can barely keep your eyes open, but through the haze, you see the sun rising. You made it. Barely, but you made it."
    ],
    "game_over_win_normal": [
        "You finally allow yourself to breathe normally, the tension draining from your shoulders. You're battered and exhausted, but standing tall as dawn breaks around you. The fear that gripped you through the night melts away in the warmth of morning light. You have survived.",
        "You lower your weapon and take a deep breath, feeling the weight of the long night settle into your bones. The exhaustion is profound, but relief washes it away like a cleansing tide. The sunrise paints the sky in brilliant colors. Against all odds, you made it through."
    ]
}