{
    "threat_horde_spawn_timed_nightfall": "A distant growl rolls across the land! A horde ({composition}) stirs from their hiding places, moving closer with growing hunger.",
    "threat_horde_spawn_timed_deep_night": "You catch glimpses of movement between the trees. A horde ({composition}) is closing in fast!",
    "threat_horde_spawn_timed_witching_hour": "The air splits with unholy shrieks! A massive horde ({composition}) emerges from the dark!",
    "threat_horde_spawn_timed_pre_dawn": "Just when you think it is over, another small horde ({composition}) moves closer!",

    "threat_noise_spawn": "You create a lot of noise. A lone {monsterName} emerges from the darkness, intrigued by the noise.",
    "threat_noise_despawn": "The noise reduces and {monsterList} {loseVerb} interest and {wanderVerb} off.",
    "threat_monsters_gone": "The coast is clear... for now.",

    
    "threat_horde_attacks_fortification_cabin": "{monsterList} {slamVerb} against the doors and windows of the cabin, dealing {totalDamage} damage!",
    "threat_horde_attacks_fortification_campGate": "{monsterList} {attackVerb} the foundations of the campsite gate, dealing {totalDamage} damage!",
    "threat_horde_attacks_fortification_graveyardGate": "{monsterList} {damageVerb} the graveyard gate, dealing {totalDamage} damage!",

    "threat_fortification_breached_cabin": "The cabin door splinters and breaks! The monsters are inside!{noLongerHiding}",
    "threat_fortification_breached_campGate": "The campsite gate breaks down, no longer usable. The monsters rush towards the campfire.{noLongerHiding}",
    "threat_fortification_breached_graveyardGate": "The old graveyard gate becomes unstable and falls apart. The monsters enter the graveyard!{noLongerHiding}",

    "threat_fortification_non_existing_cabin": "The monsters rush in through the unprotected cabin door!{noLongerHiding}",
    "threat_fortification_non_existing_campGate": "The monsters move past the unfortified campsite gate rush towards the campfire.{noLongerHiding}",
    "threat_fortification_non_existing_graveyardGate": "The old graveyard gate opens as the monsters rush through it!{noLongerHiding}",

    "threat_horde_attacks_player": "{monsterList} {swarmVerb} you, dealing {totalDamage} damage!",
    "outcome_stop_hiding": "You are no longer hiding.",

    "outcome_fortify_campGate": "You fortify the campsite gate using wood. The fortification strength is now at {strength}.",
    "outcome_fortify_cabin": "You barricade the cabin windows and door. The fortification strength is now at {strength}.",
    "outcome_fortify_graveyardGate": "You fortify the graveyard gate to make it resistant to monster attacks. The fortification strength is now at {strength}.",

    "outcome_rest_by_fire": "You rest by the campfire, catching your breath and gaining a moment to think. You gain {stamina} stamina.",
    "outcome_rest_in_cabin": "You rest inside the wooden cabin's structure. With the much needed rest, you gain {stamina} stamina.",
    "outcome_hide_in_tents": "You hide in the tents to avoid being spotted. The noise you create now reduces.",
    "outcome_hide_in_cabin": "You hide inside the cabin. You won't be spotted. Your actions do not create noise.",
    "outcome_hide_in_hut": "You scurry yourself over into the gravekeeper's hut. You avoid creating noise to not attract the monsters.",
    "outcome_wait_normal": "You take a moment to pause and recollect your thoughts.{staminaRegen}",
    "outcome_wait_hiding": "You remain hidden, waiting and watching.",
    "outcome_heal_bandages": "You carefully open and use one of the bandages to heal yourself. You regain {health} HP.",
    "outcome_heal_first_aid": "You open the first aid kit. You find some antiseptic, bandages, and some gauze rolls. You use it and regain {health} HP.",
    "outcome_eat_canned_food": "You open the can of food you have been storing. You consume its content, giving you {stamina} stamina and {health} HP.",
    "outcome_eat_cooked_mushrooms": "You eat the mushrooms you had cooked earlier. You gain {stamina} stamina and {health} HP.",
    "outcome_craft_molotov": "You fill the empty bottle with some fuel and use the old rag to craft a molotov. It is dangerous and can cause a large fire, dealing a large amount of damage to any monster horde.",
    "outcome_craft_witch_ward": "Using wood, twine, and the rowan berries, you carefully craft a Witch Ward. Witches can be hurt when they come in contact with this ward.",
    "outcome_craft_black_salt": "You combine the salt and a garlic to create black salt. Vampires are vulnerable to black salt.",
    "outcome_cook_mushrooms": "You put two mushrooms on a stick and cook them by the campfire. After a while, you collect the cooked mushrooms.",
    "outcome_set_trap_campGate": "You spend time setting up a strong trap near the campsite gate. This should stop at least one of them.",
    "outcome_set_trap_graveyardGate": "You rig a net trap to the graveyard gate, hoping it's strong enough to hold.",


    "outcome_search_rec_tent": "You rummage through the recreational tent. You find some useful items, including a baseball bat, a bow, and 5 arrows.",
    "outcome_search_woods": "You look through the woods beyond the campsite's perimeter. You collect 4 mushrooms, 2 garlics from the patch, and 1 wood.",
    "outcome_search_woods_again": "You quietly look through the woods again. You are able to find {quantity} wood.",
    "outcome_search_food_tent": "You go through the food tent. You manage to gather 2 empty bottles, 2 salt shakers, and 2 cans of food.",
    "outcome_search_utility_tent": "You look into the utility tent for any items. You find 2 old rags and 2 bandages.",
    "outcome_search_pier": "You wander off to the water body. You look near the pier for any items that could be helpful. You recover 2 nets and 2 twines.",
    "outcome_search_cabin_items": "You explore through the wooden cabin. You find 2 cans of fuel as well as a first-aid kit. They can come in handy.",
    "outcome_gather_rowan_tree": "Knowing a witch's weakness, you gather some berries from the rowan tree in the graveyard. You collect 2 rowan berries.",
    "outcome_search_gravekeepers_hut": "You go inside the gravekeeper's hut, hoping he wouldn't mind. You find 2 bandages and a door key.",
    "outcome_search_shed": "You look through the old shed. You find a rather-well-maintained axe. It can definitely strike.",

    "outcome_attack_single_zombie": "You swing at a zombie using your {weapon}. You deal {damage} HP of damage to it.{kill}",
    "outcome_attack_single_skeleton": "You swing at a skeleton using your {weapon}. You deal {damage} HP of damage to it.{kill}",
    "outcome_attack_single_spirit": "You swing at a spirit using your {weapon}. You deal {damage} HP of damage to it.{kill}",
    "outcome_attack_cleave": "You perform a cleave attack at the horde. You deal a combined {damage} HP of damage to the horde and hit {numHit} monsters.{kill}",
    "outcome_attack_incinerate": "You throw your molotov at the horde. A large fire erupts, catching {numHit} monsters ablaze and dealing a total of {damage} damage to the horde.{kill}",
    "outcome_attack_shoot": "You take your bow and arrow and shoot at a {monster}. You deal {damage} HP of damage.{kill}",
    "outcome_attack_boss_witch": "You try to attack the witch with your {weapon}. You manage to lower her health by {damage} HP.{kill}",
    "outcome_attack_boss_vampire": "You use your {weapon} and attack the vampire, dealing {damage} HP of damage.{kill}",
    "outcome_hurt_boss_witch": "You grab your Witch Ward that you crafted earlier and throw it towards the witch. It is very effective, dealing {damage} HP of damage to the witch.{kill}",
    "outcome_hurt_boss_vampire": "You collect that black salt that you have been saving and hurl it towards the vampire. The salt goes everywhere. It inflicts {damage} HP of damage to the vampire.{kill}",
    "outcome_trap_triggered": "You hear {count} loud *SNAP!* outside. Your trap worked! The trap killed {monsterName}!",

    


    "status_health_low": "Your health is low. You should find a way to heal.",
    "status_health_critical": "CRITICAL: Your health is dangerously low! Heal immediately!",
    "status_stamina_low": "You are feeling exhausted and sluggish.",
    "status_stamina_critical": "CRITICAL: You are about to collapse from exhaustion! You must rest!",



    "action_text_move_to_graveyard": "Move to Graveyard",
    "action_text_move_to_cabin": "Move to Cabin",
    "action_text_move_to_campsite": "Move to Campsite",

    "action_text_fortify_campGate": "Fortify Campsite gate",
    "action_text_fortify_cabin": "Fortify Cabin doors & windows",
    "action_text_fortify_graveyardGate": "Fortify Graveyard gate",

    "action_text_rest_fire": "Rest by the campfire",
    "action_text_rest_cabin": "Rest in the cabin",
    "action_text_hide_in_tents": "Hide in a tent",
    "action_text_hide_in_cabin": "Hide in the cabin",
    "action_text_hide_in_hut": "Hide in the gravekeeper's hut",
    "action_text_wait": "Wait and do nothing",
    "action_text_heal_bandages": "Heal using bandages",
    "action_text_heal_first_aid": "Heal using first aid kit",
    "action_text_eat_canned_food": "Eat canned food",
    "action_text_eat_cooked_mushrooms": "Eat cooked mushrooms",
    "action_text_craft_molotov": "Craft a Molotov",
    "action_text_craft_witch_ward": "Craft a Witch Ward",
    "action_text_craft_black_salt": "Craft some Black Salt",
    "action_text_cook_mushrooms": "Cook mushrooms by the campfire",
    "action_text_set_trap_campGate": "Set a trap at the campsite gate",
    "action_text_set_trap_graveyardGate": "Set a trap at the graveyard gate",

    "action_text_search_rec_tent": "Search the recreational tent",
    "action_text_search_woods": "Search in the woods",
    "action_text_search_woods_again": "Search through the woods again",
    "action_text_search_food_tent": "Search the food tent",
    "action_text_search_utility_tent": "Search the utility tent",
    "action_text_search_pier": "Search at the pier",
    "action_text_search_cabin_items": "Search for items in the cabin",
    "action_text_gather_rowan_tree": "Gather berries from the rowan tree",
    "action_text_search_gravekeepers_hut": "Search the gravekeeper's hut",
    "action_text_search_shed": "Search the shed",
    
    "action_text_attack_zombie": "Attack a Zombie",
    "action_text_attack_skeleton": "Attack a Skeleton",
    "action_text_attack_spirit": "Attack a Spirit",
    "action_text_attack_cleave": "Perform a cleave attack on the Horde", 
    "action_text_attack_incinerate": "Throw a Molotov to incinerate the Horde", 
    "action_text_attack_shoot": "Shoot at a monster using bow-and-arrow",
    "action_text_attack_boss_witch": "Attack the Witch",
    "action_text_attack_boss_vampire": "Attack the Vampire",
    "action_text_hurt_boss_witch": "Hurt the Witch",
    "action_text_hurt_boss_vampire": "Hurt the Vampire",






    "loc_desc_campsite_first": "A group of monsters is hot on your tail. The night is dangerous. You've managed to outrun the horde and get some time to get yourself under control. You find yourself in a campsite amidst a rough clearing through the woods as the sun begins to set. Several tents are pitched around a warm campfire. A wooden cabin stands at the far west. A small wooden pier extends over the dark water ahead.",
    "loc_desc_campsite_current": [
        "You remain at the campsite. The campfires burn bright, enough to provide you with some warmth.",
        "The campsite remains your position. Overhead, the trees sway gently, their branches creating shifting patterns of light and shadow across the tents and cabin",
        "You remain at the campsite, staying close to the fire's warmth. The flames pop and hiss occasionally, sending sparks spiraling upward into the night sky.",
        "You stay put at the campsite, the familiar surroundings offering what comfort they can."
    ],
    "loc_desc_campsite_return": [
        "You return to the campsite, relieved to see the fire still burning strong. The generator's hum continues to be nothing but just background noise for you.",
        "You make your way back to the centre of the campsite. The glow of the fire and cabin lights guides you in, a beacon of relative safety in the darkness.",
        "You return to the clearing, the familiar layout of the campsite greeting you. The pier stretches out into darkness and the fire burns straight ahead."
    ],

    "loc_desc_cabin_first": "You step into the wooden cabin and close the door behind you, muffling the sounds of the night outside. The interior is cozy and well-maintained. A worn sofa faces a cold fireplace, and someone's jacket hangs on a peg by the door. Maps and a schedule are pinned to a corkboard near the window. The cabin smells of pine wood, lamp oil, and the faint mustiness of a place that's lived-in but currently empty. Through the windows, you can see the campfire outside, but in here, the generator's hum is more muted. It feels safer somehow, with walls between you and whatever's out there.",
    "loc_desc_cabin_current": [
        "You remain inside the cabin, the solid walls around you providing a sense of security.",
        "You stay inside the cabin, listening to the muffled sounds of the night beyond the walls. The wooden floor creaks slightly as you shift your weight.",
        "You're still inside, grateful for the barrier between you and the darkness."
    ],
    "loc_desc_cabin_return": [
        "You return to the cabin and step back inside, pulling the door shut behind you. The lamplight welcomes you back, unchanged since you left.",
        "You return to the cabin's shelter, closing the door firmly behind you. Through the windows, you can see the campfire still burning outside, but in here feels safer.",
        "You make your way back to the cabin and enter. Everything is exactly as you left it."
    ],

    "loc_desc_graveyard_first": "You arrive at the graveyard, and a chill runs down your spine that has nothing to do with the temperature. You remember glimpsing this place earlier when you were fleeing towards the campsite. Now here you are, standing among the dead. The graveyard sprawls across uneven ground, dotted with tombstones of varying ages. A gravekeeper's hut stands near the entrance and a small locked shed sits further back.",
    "loc_desc_graveyard_current": [
        "You remain in the graveyard, acutely aware of how exposed you are here.",
        "You're still among the graves. The wind picks up slightly, making the loose shutter on the gravekeeper's hut bang.",
        "You stay in the graveyard, though every instinct screams at you to leave.",
        "You stay among the graves, counting the tombstones you can see, anything to keep your mind occupied."
    ],
    "loc_desc_graveyard_return": [
        "You make your way back to the graveyard along the path. The iron gates come into view, and beyond them, the familiar arrangement of graves and monuments.",
        "You return to the graveyard, emerging from the path into the open area among the graves.",
        "You visit the graveyard once again. You hope that you can survive an ambush here."
    ],
    

    "dusk_flavor_10": "The sun bleeds orange across the horizon, its dying light casting long shadows that stretch like grasping fingers across the ground. The air still holds the day's warmth, but there's a whisper of something colder creeping in.",
    "dusk_flavor_9": "Golden light filters through the trees, turning everything amber. The first evening birds begin their calls, oblivious to what the darkness might bring.",
    "dusk_flavor_8": "The sun sinks lower, painting the clouds in shades of crimson and purple.",
    "dusk_flavor_7": "The sky burns with the last defiant rays of daylight. A gentle breeze picks up, carrying the scent of cooling earth and distant pine.",
    "dusk_flavor_6": "Twilight settles over the landscape like a veil. The boundary between light and shadow blurs as the sun touches the horizon, preparing for its final descent.",
    "dusk_flavor_5": "The sun is half-swallowed by the earth now. Its light has turned from gold to deep orange. The ambient temperature begins to drop.",
    "dusk_flavor_4": "Only a sliver of sun remains visible, painting the sky in darkening purples. The first stars appear overhead, faint and tentative against the fading blue.",
    "dusk_flavor_3": "The last curve of the sun disappears, leaving only its afterglow.",
    "dusk_flavor_2": "The sky transitions from purple to deep indigo. Shadows have merged into larger patches of darkness, and the stars grow brighter with each passing second.",
    "dusk_flavor_1": "Dusk's final moments fade as the sky deepens to navy. The first hint of true darkness creeps across the land, and the air grows noticeably cooler against your skin.",

    "evening_flavor_8": "Evening arrives with a blanket of darker blue-grey across the heavens. The stars are now clearly visible, scattered like diamonds across velvet, and the moon begins its ascent. The comfortable warmth of day is gone, replaced by a chill that makes you pull your clothing tighter.",
    "evening_flavor_7": "The sky deepens to a rich cobalt, with the brightest stars forming their familiar constellations.",
    "evening_flavor_6": "Darkness settles more. Night sounds begin: crickets chirping and the distant hoot of an owl setting out to hunt.",
    "evening_flavor_5": "The moon climbs higher, casting everything in shades of silver and shadow. Trees become dark silhouettes against the star-filled sky, their branches like skeletal hands reaching upward.",
    "evening_flavor_4": "Evening's grip tightens as the last traces of twilight vanish from the western horizon. The night is fully awake now, and every sound seems amplified in the quiet darkness.",
    "evening_flavor_3": "The moon's light creates a patchwork of illumination and shadow across the ground. A cold breeze rustles through the vegetation, carrying sounds that are harder to identify in the dark.",
    "evening_flavor_2": "Moonlight now gleams off surfaces: water, stone, anything smooth enough to reflect it back.",
    "evening_flavor_1": "Evening reaches its deepest point before transitioning to true night. The stars wheel slowly overhead, and the shadows seem to shift and move at the edges of your vision.",

    "nightfall_flavor_8": "True nightfall descends like a curtain, and the darkness takes on weight and substance. The moon hangs bright but somehow distant, its light feeling colder now, less comforting than before. The night sounds have changed: some creatures have gone silent, while others you can't identify have started calling.",
    "nightfall_flavor_7": "The cold intensifies as the temperature plummets. Shadows pool thick and heavy beneath trees and overhangs, places where moonlight cannot reach.",
    "nightfall_flavor_6": "A deep chill has settled over everything. Your breath comes out in visible clouds now.",
    "nightfall_flavor_5": "The night deepens further still. The moon's journey across the sky continues, and its angle creates unfamiliar shadows that make familiar landscapes seem strange and foreign.",
    "nightfall_flavor_4": "The remaining warmth left over from the day is completely gone, replaced by the deep cold of true night.",
    "nightfall_flavor_3": "Silence falls more heavily now, broken only by the occasional crack of a twig or the distant cry of a night bird. The darkness between shadows seems somehow darker.",
    "nightfall_flavor_2": "The moon reaches its highest point, bathing everything in pale, colorless light. But there are more shadows now.",
    "nightfall_flavor_1": "The world feels suspended, caught between the evening that was and the deeper darkness yet to come.",

    "deep_night_flavor_9": "Deep night arrives with an almost physical presence, as if the darkness itself has grown thicker, more tangible. The moon continues its arc but seems to give less light than before, its beams struggling to penetrate the gloom. Strange sounds echo from the darkness. This is the hour when natural creatures hide, and other forces emerge.",
    "deep_night_flavor_8": "Shadows seem to pulse and breathe at the periphery of vision, never quite still when you're not looking directly at them.",
    "deep_night_flavor_7": "An unnatural mist begins to rise from the ground, curling around rocks and tree roots like grasping fingers.",
    "deep_night_flavor_6": "The moonlight takes on an eerie quality, turning everything it touches into shades of grey and white.",
    "deep_night_flavor_5": "The Deep Night continues as the time passes. Sounds that shouldn't exist drift through the air: whispers without words, footsteps without feet.",
    "deep_night_flavor_4": "The night sky deepens into absolute black, like a void, dotted with stars.",
    "deep_night_flavor_3": "The cold mist continues to form. Something feels fundamentally wrong about this hour.",
    "deep_night_flavor_2": "The moon's light wavers, as if something massive is passing between it and the earth.",
    "deep_night_flavor_1": "The boundary between what's real and what isn't seems thinner here, at this depth of night. Shapes in the mist could be trees, or they could be something else entirely.",

    "witching_hour_flavor_10": "The Witching Hour crashes down like a wave of pure darkness. The moon dims as if shrouded by invisible clouds, and the stars themselves seem to flicker uncertainly. The temperature plummets. This is the time when the veil is thinnest, when the dead walk and the things that should not be find their way into the world.",
    "witching_hour_flavor_9": "The darkness writhes and pulses with unseen presence. Shapes seem move through the mist with purpose now.",
    "witching_hour_flavor_8": "The night sky intensifies. The shadows have gained depth, becoming doorways to somewhere else.",
    "witching_hour_flavor_7": "The moon bleeds a sickly color, somewhere between silver and red.",
    "witching_hour_flavor_6": "Time feels distorted, stretching and compressing. Seconds last hours, minutes pass in heartbeats.",
    "witching_hour_flavor_5": "The Witching Hour reaches its apex. The boundary between worlds is paper-thin now, and things press against it from the other side.",
    "witching_hour_flavor_4": "Dead leaves swirl in spirals without wind to move them. Every sound seems swallowed by the oppressive stillness. The ground itself seems to hold its breath.",
    "witching_hour_flavor_3": "The Witching Hour continues. The stars trace paths slowly, offering no sign of hope or dawn to come.",
    "witching_hour_flavor_2": "The stars begin their slow wheel toward morning positions, though dawn is still impossibly far away.",
    "witching_hour_flavor_1": "The witching hour's grip begins to weaken... barely. The absolute stillness starts to break as the faintest breath of wind stirs. The moon's color begins its slow fade back toward normal silver.",

    "pre_dawn_flavor_5": "The first hint of change arrives. The absolute black of the sky begins to lighten to merely dark grey in the far east. The unnaturality that filled the witching hour seems to have stopped. The temperature remains brutally cold, but no longer drops. The moon, pale and exhausted, begins its descent toward the western horizon. You've survived the worst. You just have to hold on a little longer.",
    "pre_dawn_flavor_4": "The eastern horizon shows a line of slightly lighter grey, barely distinguishable from the darkness above it.",
    "pre_dawn_flavor_3": "The stars begin to fade, the brightest ones clinging to visibility as the sky slowly lightens.",
    "pre_dawn_flavor_2": "The shadows lose their depth and menace, becoming ordinary darkness once more. Birds begin their first tentative chirps.",
    "pre_dawn_flavor_1": "The pre-dawn light strengthens, turning the world into a landscape of grey, silver, and yellow. The moon sets as its night's work done, and the cold finally begins to lose its cruel edge.",

    "phase_intro_dawn": "Dawn breaks like a golden sword cutting through the last remnants of darkness. The sun crests the horizon in a blaze of orange and pink and gold. The light is warm and real. The frost begins to melt immediately. Birds erupt into full chorus, celebrating the return of day with joyous abandon. The shadows retreat to their proper places. The cold breaks as warmth floods across the land, and you can finally breathe freely, deeply, without fear."
}